<a href="https://colab.research.google.com/github/bttrung/python-study-notebooks/blob/master/pandas/6_Deal_with_NaN.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [17]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35}, {'watches': 10, 'bikes': 15, 'suits': 44, 'pants': 2, 'shirts': 8}, {'watches': 1, 'pants': 5, 'suits': 43, 'shirts': 5}]
sc = pd.DataFrame(items, index=['store 1', 'store 2', 'store 3'])
sc

         bikes  pants  shirts  suits  watches
store 1   20.0     30     NaN    NaN       35
store 2   15.0      2     8.0   44.0       10
store 3    NaN      5     5.0   43.0        1

In [18]:
x = sc.isnull()
x

         bikes  pants  shirts  suits  watches
store 1  False  False    True   True    False
store 2  False  False   False  False    False
store 3   True  False   False  False    False

In [19]:
x = sc.isnull().sum()
x

bikes      1
pants      0
shirts     1
suits      1
watches    0
dtype: int64

In [20]:
x = sc.isnull().sum().sum()
x

3

In [21]:
sc.count()

bikes      2
pants      3
shirts     2
suits      2
watches    3
dtype: int64

In [22]:
# drop any row has NaN data
sc.dropna(axis=0)

         bikes  pants  shirts  suits  watches
store 2   15.0      2     8.0   44.0       10

In [24]:
# drop any column has NaN value
sc.dropna(axis=1)

         pants  watches
store 1     30       35
store 2      2       10
store 3      5        1

In [26]:
# fill NaN with other value
sc.fillna(0)

         bikes  pants  shirts  suits  watches
store 1   20.0     30     0.0    0.0       35
store 2   15.0      2     8.0   44.0       10
store 3    0.0      5     5.0   43.0        1

In [27]:
sc.fillna('a')

        bikes  pants shirts suits  watches
store 1    20     30      a     a       35
store 2    15      2      8    44       10
store 3     a      5      5    43        1

In [28]:
sc.fillna(0.)

         bikes  pants  shirts  suits  watches
store 1   20.0     30     0.0    0.0       35
store 2   15.0      2     8.0   44.0       10
store 3    0.0      5     5.0   43.0        1

In [29]:
sc

         bikes  pants  shirts  suits  watches
store 1   20.0     30     NaN    NaN       35
store 2   15.0      2     8.0   44.0       10
store 3    NaN      5     5.0   43.0        1

In [31]:
# replace NaN values with the previous value in the row
sc.fillna(method='ffill', axis=1)

         bikes  pants  shirts  suits  watches
store 1   20.0   30.0    30.0   30.0     35.0
store 2   15.0    2.0     8.0   44.0     10.0
store 3    NaN    5.0     5.0   43.0      1.0

In [32]:
# replace NaN values with the next value in the column
sc.fillna(method='backfill', axis=0)

         bikes  pants  shirts  suits  watches
store 1   20.0     30     8.0   44.0       35
store 2   15.0      2     8.0   44.0       10
store 3    NaN      5     5.0   43.0        1

In [34]:
# replace NaN values by using linear interpolation using column values
sc.interpolate(method='linear', axis=0)

         bikes  pants  shirts  suits  watches
store 1   20.0     30     NaN    NaN       35
store 2   15.0      2     8.0   44.0       10
store 3   15.0      5     5.0   43.0        1

In [35]:
# replace NaN values by using linear interpolation using row values
sc.interpolate(method='linear', axis=1)

         bikes  pants     shirts      suits  watches
store 1   20.0   30.0  31.666667  33.333333     35.0
store 2   15.0    2.0   8.000000  44.000000     10.0
store 3    NaN    5.0   5.000000  43.000000      1.0